{"contributing":0,"vllm":1,"you":2,"may":3,"find":4,"information":5,"about":6,"docs":7,"ai":8,"https":9,"en":10,"latest":11,"markdownlint":12,"disable":13,"md001":14,"md041":15,"align":16,"center":17,"picture":18,"source":19,"media":20,"prefers":21,"color":22,"scheme":23,"dark":24,"srcset":25,"raw":26,"githubusercontent":27,"com":28,"project":29,"main":30,"assets":31,"logos":32,"logo":33,"text":34,"png":35,"img":36,"alt":37,"src":38,"light":39,"width":40,"55":41,"h3":42,"easy":43,"fast":44,"cheap":45,"llm":46,"serving":47,"everyone":48,"href":49,"documentation":50,"blog":51,"arxiv":52,"org":53,"abs":54,"2309":55,"06180":56,"paper":57,"vllm_project":58,"twitter":59,"discuss":60,"user":61,"forum":62,"slack":63,"developer":64,"news":65,"2025":66,"08":67,"we":68,"hosted":69,"beijing":70,"meetup":71,"mp":72,"weixin":73,"qq":74,"dgkwg1wfpwgo2jcdtqqhxa":75,"focusing":76,"large":77,"scale":78,"deployment":79,"please":80,"slides":81,"here":82,"drive":83,"google":84,"folders":85,"1pid6nsflu43dzri0eatcpgxsazdvbbqf":86,"recording":87,"www":88,"chaspark":89,"live":90,"1166916873711665152":91,"05":92,"nyc":93,"lu":94,"ma":95,"c1rqyf1f":96,"presentation":97,"1_q_aw_iomjwuimf1s1ym":98,"zhjxz8cuel0ijvaquoybea":99,"edit":100,"usp":101,"sharing":102,"now":103,"under":104,"pytorch":105,"foundation":106,"announcement":107,"welcomes":108,"01":109,"excited":110,"announce":111,"alpha":112,"release":113,"v1":114,"major":115,"architectural":116,"upgrade":117,"7x":118,"speedup":119,"clean":120,"code":121,"optimized":122,"execution":123,"loop":124,"zero":125,"overhead":126,"prefix":127,"caching":128,"enhanced":129,"multimodal":130,"support":131,"more":132,"check":133,"out":134,"our":135,"post":136,"27":137,"html":138,"details":139,"summary":140,"previous":141,"04":142,"asia":143,"day":144,"sginnovate":145,"event":146,"limited":147,"availability":148,"morning":149,"evening":150,"slots":151,"remaining":152,"inaugural":153,"from":154,"team":155,"19cp6qu8u48ihb91a064xfaxrunyiboukrbxamdolloo":156,"03":157,"ollama":158,"inference":159,"night":160,"16t2pdd1ywrnz4tu8q5r6n53c5lr5c73uv9vd2_ebo4u":161,"first":162,"china":163,"n77gibl2coratqhtveazfg":164,"1rehvfqmkgnvz6p3fd23hhso4c8j5wpgzv0bkylwnhyq":165,"east":166,"coast":167,"7mu4k4xx":168,"1nhiv8euff1nld3feyodm56ndml26leexcadgydltsrs":169,"slide":170,"id":171,"g31441846c39_0_0":172,"02":173,"ninth":174,"h7g3kuj9":175,"meta":176,"1jzc_pzvxrvnsfvcw":177,"v4cfxb6pn7zz2cyp_flwo05aqg":178,"amd":179,"file":180,"1zk5qejiktmlq2eqcxqzlljax3m9s7nwn":181,"view":182,"posted":183,"eighth":184,"zep56hui":185,"cloud":186,"1epvkt4zu8jz_s5ohehpc798emsyh2bwyfruddvef7u4":187,"1h24phewanyrl11xy5dxubvrc9f9kkjix":188,"2024":189,"12":190,"joins":191,"ecosystem":192,"11":193,"seventh":194,"h0qvrajz":195,"snowflake":196,"1e3cxqbv3jsfgp30swyvs3em_tw":197,"ghohj9pajgk6kr54":198,"1qf3rkdaboulwz9wk5toltt2fe9t6uic_hvnlfaaqx6a":199,"10":200,"have":201,"just":202,"created":203,"coordinating":204,"contributions":205,"discussing":206,"features":207,"feel":208,"free":209,"join":210,"us":211,"ray":212,"summit":213,"held":214,"special":215,"track":216,"opening":217,"talk":218,"1b_kqxphbtra_mdf":219,"tr6i8rwdou5qotznceg2mkzxehm":220,"learn":221,"talks":222,"youtube":223,"playlist":224,"list":225,"plztswpqnepxl6aqwifuwuimlpfrvpksjr":226,"other":227,"contributors":228,"users":229,"09":230,"sixth":231,"87q3nvnh":232,"nvidia":233,"1wrlgwytqfaotd5wcgspnhoaw3nq0e":234,"9wqyp7ny93xrs":235,"07":236,"fifth":237,"lp0gyjqr":238,"aws":239,"1rgud8acfchocghop3zmxzck9vx3rci9yfuab2bbcl4y":240,"partnership":241,"officially":242,"supports":243,"llama":244,"fp8":245,"quantization":246,"pipeline":247,"parallelism":248,"23":249,"llama31":250,"06":251,"fourth":252,"agivllm":253,"cloudflare":254,"bentoml":255,"1ij8o7v2bqei0bfeljltwc5g1s10_rhv3beed5ob0nj4":256,"third":257,"robloxandvllmmeetup2024":258,"splashthat":259,"roblox":260,"1a":261,"47jak4bj39t954hytkvtfwn0fkqtsl8ngfuslrem":262,"second":263,"ygxbpzhl":264,"ibm":265,"12mi2skabnuw5rbwxdyy":266,"hthth4imsnceoq10jdqbxga":267,"2023":268,"a16z":269,"1ql":270,"xpfxifpdbh86dbeegfxbxfxjix4v032ghshbkf3s":271,"would":272,"like":273,"express":274,"sincere":275,"gratitude":276,"andreessen":277,"horowitz":278,"30":279,"supporting":280,"open":281,"community":282,"providing":283,"generous":284,"grant":285,"development":286,"research":287,"released":288,"fastchat":289,"integration":290,"has":291,"powered":292,"lmsys":293,"vicuna":294,"chatbot":295,"arena":296,"chat":297,"since":298,"mid":299,"april":300,"use":301,"library":302,"originally":303,"developed":304,"sky":305,"computing":306,"lab":307,"cs":308,"berkeley":309,"edu":310,"uc":311,"evolved":312,"driven":313,"both":314,"academia":315,"industry":316,"state":317,"art":318,"throughput":319,"efficient":320,"management":321,"attention":322,"key":323,"value":324,"memory":325,"pagedattention":326,"20":327,"continuous":328,"batching":329,"incoming":330,"requests":331,"model":332,"cuda":333,"hip":334,"graph":335,"quantizations":336,"gptq":337,"2210":338,"17323":339,"awq":340,"2306":341,"00978":342,"autoround":343,"05516":344,"int4":345,"int8":346,"kernels":347,"including":348,"flashattention":349,"flashinfer":350,"speculative":351,"decoding":352,"chunked":353,"prefill":354,"flexible":355,"seamless":356,"popular":357,"hugging":358,"face":359,"models":360,"high":361,"various":362,"algorithms":363,"parallel":364,"sampling":365,"beam":366,"search":367,"tensor":368,"data":369,"expert":370,"distributed":371,"streaming":372,"outputs":373,"openai":374,"compatible":375,"api":376,"server":377,"gpus":378,"cpus":379,"intel":380,"powerpc":381,"tpu":382,"neuron":383,"multi":384,"lora":385,"seamlessly":386,"most":387,"huggingface":388,"transformer":389,"llms":390,"mixture":391,"mixtral":392,"deepseek":393,"v2":394,"v3":395,"embedding":396,"e5":397,"mistral":398,"modal":399,"llava":400,"full":401,"supported":402,"supported_models":403,"getting":404,"started":405,"install":406,"pip":407,"getting_started":408,"installation":409,"gpu":410,"index":411,"build":412,"wheel":413,"bash":414,"visit":415,"quickstart":416,"welcome":417,"any":418,"collaborations":419,"how":420,"get":421,"involved":422,"sponsors":423,"compute":424,"resources":425,"testing":426,"following":427,"organizations":428,"thank":429,"your":430,"note":431,"sort":432,"them":433,"alphabetical":434,"order":435,"keep":436,"consistent":437,"md":438,"cash":439,"donations":440,"dropbox":441,"sequoia":442,"capital":443,"skywork":444,"zhenfund":445,"alibaba":446,"anyscale":447,"crusoe":448,"databricks":449,"deepinfra":450,"lambda":451,"nebius":452,"novita":453,"replicate":454,"runpod":455,"trainy":456,"san":457,"diego":458,"sponsor":459,"also":460,"official":461,"fundraising":462,"venue":463,"through":464,"opencollective":465,"plan":466,"fund":467,"maintenance":468,"adoption":469,"citation":470,"cite":471,"bibtex":472,"inproceedings":473,"kwon2023efficient":474,"title":475,"language":476,"author":477,"woosuk":478,"kwon":479,"zhuohan":480,"li":481,"siyuan":482,"zhuang":483,"ying":484,"sheng":485,"lianmin":486,"zheng":487,"cody":488,"hao":489,"yu":490,"joseph":491,"gonzalez":492,"zhang":493,"ion":494,"stoica":495,"booktitle":496,"proceedings":497,"acm":498,"sigops":499,"29th":500,"symposium":501,"operating":502,"systems":503,"principles":504,"year":505,"contact":506,"start":507,"technical":508,"questions":509,"feature":510,"github":511,"issues":512,"fellow":513,"security":514,"disclosures":515,"advisories":516,"partnerships":517,"lists":518,"mailto":519,"end":520,"kit":521,"wish":522,"refer":523,"repo":524,"releasing":525,"releases":526,"offer":527,"reliable":528,"version":529,"base":530,"packaged":531,"binary":532,"format":533,"can":534,"conveniently":535,"accessed":536,"via":537,"pypi":538,"serve":539,"milestones":540,"communicate":541,"newly":542,"available":543,"improvements":544,"upcoming":545,"changes":546,"could":547,"affect":548,"potential":549,"breaking":550,"versioning":551,"uses":552,"right":553,"shifted":554,"where":555,"new":556,"patch":557,"every":558,"weeks":559,"contain":560,"bug":561,"fixes":562,"opposed":563,"semver":564,"contains":565,"only":566,"backwards":567,"when":568,"critical":569,"need":570,"made":571,"post1":572,"_major_":573,"milestone":574,"incompatible":575,"similar":576,"_minor_":577,"_patch_":578,"_post1_":579,"_patch":580,"1_":581,"either":582,"explicit":583,"implicit":584,"cadence":585,"bi":586,"weekly":587,"basis":588,"days":589,"after":590,"same":591,"branch":592,"all":593,"future":594,"dates":595,"below":596,"tentative":597,"optional":598,"date":599,"versions":600,"jan":601,"feb":602,"mar":603,"apr":604,"jun":605,"jul":606,"13":607,"aug":608,"14":609,"15":610,"sep":611,"16":612,"17":613,"oct":614,"18":615,"19":616,"nov":617,"21":618,"dec":619,"22":620,"each":621,"built":622,"dedicated":623,"cut":624,"performed":625,"before":626,"previously":627,"reused":628,"builds":629,"triggered":630,"push":631,"rc":632,"tag":633,"vx":634,"rc1":635,"enables":636,"test":637,"multiple":638,"rcs":639,"final":640,"does":641,"trigger":642,"used":643,"notes":644,"monitor":645,"reverts":646,"apply":647,"cherry":648,"pick":649,"criteria":650,"approach":651,"finalizing":652,"clear":653,"what":654,"picks":655,"allowed":656,"process":657,"land":658,"pr":659,"typically":660,"ensure":661,"sufficient":662,"time":663,"complete":664,"thorough":665,"round":666,"stable":667,"regression":668,"address":669,"functional":670,"performance":671,"against":672,"recent":673,"severe":674,"issue":675,"silent":676,"incorrectness":677,"compatibility":678,"crashes":679,"deadlocks":680,"leaks":681,"introduced":682,"specific":683,"change":684,"identifiers":685,"ci":686,"work":687,"prs":688,"considered":689,"merged":690,"trunk":691,"exception":692,"manual":693,"validations":694,"e2e":695,"validation":696,"perform":697,"regressions":698,"benchmark":699,"workflow":700,"actions":701,"workflows":702,"yml":703,"current":704,"coverage":705,"llama3":706,"llama4":707,"hardware":708,"h100":709,"mi300x":710,"_note":711,"based":712,"availability_":713,"step":714,"access":715,"request":716,"write":717,"repository":718,"run":719,"review":720,"setup":721,"familiarize":722,"yourself":723,"configurations":724,"tree":725,"benchmarks":726,"rocm":727,"navigate":728,"configure":729,"set":730,"v0":731,"commit":732,"hash":733,"results":734,"once":735,"completes":736,"dashboard":737,"hud":738,"reponame":739,"2fvllm":740,"corresponding":741,"comparison":742,"compare":743,"verify":744,"occurred":745,"example":746,"vs":747,"starttime":748,"thu":749,"2c":750,"2017":751,"20apr":752,"202025":753,"2021":754,"3a43":755,"3a50":756,"20gmt":757,"stoptime":758,"wed":759,"2016":760,"20jul":761,"granularity":762,"week":763,"lbranch":764,"lcommit":765,"b6553be1bc75f046b00046a4ad7576364d03c835":766,"rbranch":767,"rcommit":768,"a5dd03c1ebc5e4f56f3c9d3dc0436e9c582c978f":769,"benchmarkname":770,"modelname":771,"20models":772,"backendname":773,"20backends":774,"modename":775,"20modes":776,"dtypename":777,"20dtype":778,"devicename":779,"20devices":780,"archname":781,"20platforms":782,"conduct":783,"pledge":784,"members":785,"leaders":786,"make":787,"participation":788,"harassment":789,"experience":790,"regardless":791,"age":792,"body":793,"size":794,"visible":795,"invisible":796,"disability":797,"ethnicity":798,"sex":799,"characteristics":800,"gender":801,"identity":802,"expression":803,"level":804,"education":805,"socioeconomic":806,"status":807,"nationality":808,"personal":809,"appearance":810,"race":811,"caste":812,"religion":813,"sexual":814,"orientation":815,"act":816,"interact":817,"ways":818,"contribute":819,"welcoming":820,"diverse":821,"inclusive":822,"healthy":823,"standards":824,"examples":825,"behavior":826,"contributes":827,"positive":828,"environment":829,"include":830,"demonstrating":831,"empathy":832,"kindness":833,"toward":834,"people":835,"being":836,"respectful":837,"differing":838,"opinions":839,"viewpoints":840,"experiences":841,"giving":842,"gracefully":843,"accepting":844,"constructive":845,"feedback":846,"responsibility":847,"apologizing":848,"those":849,"affected":850,"mistakes":851,"learning":852,"best":853,"individuals":854,"overall":855,"unacceptable":856,"sexualized":857,"imagery":858,"advances":859,"kind":860,"trolling":861,"insulting":862,"derogatory":863,"comments":864,"political":865,"attacks":866,"public":867,"private":868,"publishing":869,"others":870,"physical":871,"email":872,"without":873,"permission":874,"which":875,"reasonably":876,"inappropriate":877,"professional":878,"setting":879,"enforcement":880,"responsibilities":881,"responsible":882,"clarifying":883,"enforcing":884,"acceptable":885,"take":886,"appropriate":887,"fair":888,"corrective":889,"action":890,"response":891,"deem":892,"threatening":893,"offensive":894,"harmful":895,"remove":896,"reject":897,"commits":898,"wiki":899,"edits":900,"aligned":901,"reasons":902,"moderation":903,"decisions":904,"scope":905,"applies":906,"within":907,"spaces":908,"individual":909,"representing":910,"using":911,"posting":912,"social":913,"account":914,"acting":915,"appointed":916,"representative":917,"online":918,"offline":919,"irl":920,"instances":921,"abusive":922,"harassing":923,"otherwise":924,"reported":925,"channel":926,"complaints":927,"reviewed":928,"investigated":929,"promptly":930,"fairly":931,"obligated":932,"respect":933,"privacy":934,"reporter":935,"incident":936,"guidelines":937,"follow":938,"impact":939,"determining":940,"consequences":941,"violation":942,"correction":943,"deemed":944,"unprofessional":945,"unwelcome":946,"consequence":947,"written":948,"warning":949,"clarity":950,"around":951,"nature":952,"explanation":953,"why":954,"apology":955,"requested":956,"single":957,"series":958,"continued":959,"interaction":960,"unsolicited":961,"specified":962,"period":963,"includes":964,"avoiding":965,"interactions":966,"well":967,"external":968,"channels":969,"violating":970,"terms":971,"lead":972,"temporary":973,"permanent":974,"ban":975,"serious":976,"sustained":977,"communication":978,"during":979,"pattern":980,"aggression":981,"disparagement":982,"classes":983,"attribution":984,"adapted":985,"contributor":986,"covenant":987,"code_of_conduct":988,"were":989,"inspired":990,"mozilla":991,"ladder":992,"inclusion":993,"answers":994,"common":995,"see":996,"faq":997,"translations":998,"policy":999,"reporting":1000,"report":1001,"privately":1002,"vulnerability":1003,"submission":1004,"form":1005,"triage":1006,"reports":1007,"triaged":1008,"vulnerability_management":1009,"threat":1010,"guide":1011,"usage":1012,"assumptions":1013,"recommendations":1014,"blob":1015,"securely":1016,"severity":1017,"determine":1018,"risk":1019,"taking":1020,"dealing":1021,"past":1022,"defaults":1023,"cases":1024,"categories":1025,"vulnerabilities":1026,"allow":1027,"remote":1028,"attackers":1029,"execute":1030,"arbitrary":1031,"control":1032,"system":1033,"significantly":1034,"compromise":1035,"confidentiality":1036,"integrity":1037,"privileges":1038,"needed":1039,"network":1040,"deserialization":1041,"exploit":1042,"chains":1043,"generally":1044,"rated":1045,"cvss":1046,"flaws":1047,"elevated":1048,"rce":1049,"contexts":1050,"significant":1051,"loss":1052,"require":1053,"advanced":1054,"conditions":1055,"some":1056,"trust":1057,"modes":1058,"node":1059,"privileged":1060,"required":1061,"scores":1062,"between":1063,"moderate":1064,"cause":1065,"denial":1066,"service":1067,"partial":1068,"disruption":1069,"do":1070,"breach":1071,"rating":1072,"low":1073,"minor":1074,"informational":1075,"logging":1076,"errors":1077,"non":1078,"exploitable":1079,"weaknesses":1080,"local":1081,"privilege":1082,"negligible":1083,"side":1084,"collisions":1085,"often":1086,"less":1087,"than":1088,"prenotification":1089,"certain":1090,"prenotify":1091,"vendors":1092,"ship":1093,"purpose":1094,"coordinated":1095,"notification":1096,"adding":1097,"contacts":1098,"advisory":1099,"few":1100,"added":1101,"group":1102,"send":1103,"copying":1104,"vendor":1105,"analyzed":1106,"case":1107,"withdraw":1108,"receiving":1109,"prenotifications":1110,"membership":1111,"refinements":1112,"who":1113,"included":1114,"profiling":1115,"script":1116,"profile":1117,"decode":1118,"token":1119,"shapes":1120,"actual":1121,"running":1122,"mix":1123,"many":1124,"assume":1125,"already":1126,"tested":1127,"v6e":1128,"installed":1129,"according":1130,"google_tpu":1131,"several":1132,"warmups":1133,"so":1134,"enforce":1135,"eager":1136,"okay":1137,"generate":1138,"trace":1139,"runs":1140,"qwen":1141,"qwen2":1142,"7b":1143,"instruct":1144,"1024":1145,"input":1146,"tokens":1147,"up":1148,"attempt":1149,"operations":1150,"export":1151,"xla_hlo_debug":1152,"vllm_tpu_profile_duration_ms":1153,"3000":1154,"vllm_tpu_profile_delay_ms":1155,"python3":1156,"py":1157,"len":1158,"output":1159,"batch":1160,"max":1161,"2048":1162,"result":1163,"dir":1164,"profiles":1165,"70b":1166,"32":1167,"128":1168,"decodes":1169,"having":1170,"extremely":1171,"small":1172,"1000":1173,"skip":1174,"hopefully":1175,"2000":1176,"rm":1177,"rf":1178,"cache":1179,"xla_cache":1180,"visualizing":1181,"collected":1182,"visualize":1183,"tensorboard":1184,"xla":1185,"vm":1186,"likely":1187,"dependencies":1188,"tensorflow":1189,"cpu":1190,"plugin":1191,"etils":1192,"importlib_resources":1193,"point":1194,"directory":1195,"saved":1196,"http":1197,"localhost":1198,"6006":1199,"browser":1200,"logdir":1201,"port":1202,"omni":1203,"folder":1204,"provides":1205,"scripts":1206,"thinker":1207,"audio":1208,"image":1209,"video":1210,"python":1211,"offline_inference":1212,"qwen2_5_omni":1213,"only_thinker":1214,"mixed_modalities":1215,"read":1216,"vision":1217,"inputs":1218,"engine":1219,"interleaved":1220,"modalities":1221,"yet":1222,"vllm_use_v1":1223,"use_audio_in_video":1224,"audios":1225,"multi_audios":1226,"part":1227,"modality":1228,"audio_language":1229,"type":1230,"vision_language":1231,"disaggregated":1232,"demonstrate":1233,"files":1234,"sh":1235,"helper":1236,"prefill_example":1237,"decode_example":1238,"sequentially":1239,"sure":1240,"performs":1241,"saving":1242,"kv":1243,"local_storage":1244,"prompts":1245,"txt":1246,"loading":1247,"basic":1248,"class":1249,"primary":1250,"interface":1251,"doing":1252,"interacting":1253,"separate":1254,"shows":1255,"should":1256,"rest":1257,"argument":1258,"parser":1259,"argparse":1260,"pass":1261,"arguments":1262,"try":1263,"help":1264,"classify":1265,"embed":1266,"score":1267,"accept":1268,"parameters":1269,"inference_params":1270,"max_tokens":1271,"temperature":1272,"top_p":1273,"top_k":1274,"passing":1275,"experiment":1276,"default":1277,"generation":1278,"config":1279,"specifies":1280,"loaded":1281,"calling":1282,"get_default_sampling_params":1283,"auto":1284,"path":1285,"provided":1286,"max_new_tokens":1287,"sets":1288,"wide":1289,"limit":1290,"number":1291,"gguf":1292,"quantized":1293,"one":1294,"downloading":1295,"huggingface_hub":1296,"import":1297,"hf_hub_download":1298,"repo_id":1299,"bartowski":1300,"phi":1301,"medium":1302,"4k":1303,"filename":1304,"iq2_m":1305,"print":1306,"printed":1307,"above":1308,"tokenizer":1309,"microsoft":1310,"offload":1311,"gb":1312,"seen":1313,"virtual":1314,"way":1315,"increase":1316,"24":1317,"virtually":1318,"think":1319,"34":1320,"load":1321,"13b":1322,"bf16":1323,"weight":1324,"requires":1325,"least":1326,"26gb":1327,"interconnect":1328,"fly":1329,"forward":1330,"hf":1331,"important":1332,"performing":1333,"consists":1334,"json":1335,"objects":1336,"lines":1337,"openai_batch":1338,"openai_example_batch":1339,"jsonl":1340,"line":1341,"represents":1342,"package":1343,"reference":1344,"platform":1345,"requestinput":1346,"currently":1347,"completions":1348,"embeddings":1349,"endpoints":1350,"coming":1351,"soon":1352,"pre":1353,"requisites":1354,"document":1355,"8b":1356,"create":1357,"co":1358,"hub":1359,"machine":1360,"cli":1361,"login":1362,"gated":1363,"visiting":1364,"card":1365,"agreeing":1366,"along":1367,"download":1368,"own":1369,"working":1370,"wget":1371,"ve":1372,"look":1373,"cat":1374,"custom_id":1375,"method":1376,"url":1377,"messages":1378,"role":1379,"content":1380,"helpful":1381,"assistant":1382,"hello":1383,"world":1384,"max_completion_tokens":1385,"unhelpful":1386,"tool":1387,"designed":1388,"command":1389,"its":1390,"called":1391,"entrypoints":1392,"run_batch":1393,"383d1c59835645aeb2e07d004d62a826":1394,"cmpl":1395,"61c020e54b964d5a98fa7527bfcdd378":1396,"object":1397,"completion":1398,"1715633336":1399,"choices":1400,"message":1401,"great":1402,"meet":1403,"tasks":1404,"mind":1405,"today":1406,"logprobs":1407,"null":1408,"finish_reason":1409,"stop":1410,"stop_reason":1411,"prompt_tokens":1412,"25":1413,"total_tokens":1414,"56":1415,"completion_tokens":1416,"31":1417,"error":1418,"42e3d09b14b04568afa3f1797751a267":1419,"f44d049f6b3a42d4b2d7850bb1e31bcc":1420,"silence":1421,"runner":1422,"urls":1423,"accessible":1424,"located":1425,"integrating":1426,"s3":1427,"integrate":1428,"storage":1429,"recommend":1430,"presigned":1431,"additional":1432,"prerequisites":1433,"bucket":1434,"amazon":1435,"amazons3":1436,"userguide":1437,"creating":1438,"awscli":1439,"credentials":1440,"interactively":1441,"boto3":1442,"upload":1443,"cp":1444,"my_bucket":1445,"my_input_file":1446,"generated":1447,"sdk":1448,"replace":1449,"my_output_file":1450,"placeholders":1451,"names":1452,"awsdocs":1453,"doc":1454,"example_code":1455,"s3_basics":1456,"presigned_url":1457,"botocore":1458,"exceptions":1459,"clienterror":1460,"def":1461,"generate_presigned_url":1462,"s3_client":1463,"client_method":1464,"method_parameters":1465,"expires_in":1466,"param":1467,"client":1468,"name":1469,"seconds":1470,"valid":1471,"return":1472,"clientmethod":1473,"params":1474,"expiresin":1475,"except":1476,"raise":1477,"input_url":1478,"get_object":1479,"3600":1480,"output_url":1481,"put_object":1482,"west":1483,"amazonaws":1484,"awsaccesskeyid":1485,"abcdefghijklmnopqrst":1486,"signature":1487,"abcdefghijklmnopqrstuvwxyz12345":1488,"expires":1489,"1715800091":1490,"section":1491,"terminal":1492,"endpoint":1493,"add":1494,"intfloat":1495,"even":1496,"long":1497,"must":1498,"earlier":1499,"db0f71f7dec244e6bce530e0b4ef908b":1500,"status_code":1501,"200":1502,"request_id":1503,"3580bf4d4ae54d52b67eee266a6eab20":1504,"embd":1505,"33ac2efa7996430184461f2e38529746":1506,"444647":1507,"016204833984375":1508,"0092010498046875":1509,"0018358230590820312":1510,"0028228759765625":1511,"001422882080078125":1512,"0031147003173828125":1513,"baai":1514,"bge":1515,"reranker":1516,"m3":1517,"text_1":1518,"france":1519,"text_2":1520,"brazil":1521,"brasilia":1522,"paris":1523,"f87c5c4539184f618e555744a2965987":1524,"806ab64512e44071b37d3f7ccd291413":1525,"4ee45236897b4d29907d49b01298cdb1":1526,"1737847944":1527,"0010900497436523438":1528,"37":1529,"prompt_tokens_details":1530,"41990c51a26d4fac8419077f12871099":1531,"73ce66379026482699f81974e14e1e99":1532,"13f2ffe6ba40460fbf9f7f00ad667d75":1533,"001094818115234375":1534,"configuration":1535,"leverages":1536,"dictconfig":1537,"functionality":1538,"enable":1539,"robust":1540,"loggers":1541,"offers":1542,"two":1543,"variables":1544,"accommodate":1545,"range":1546,"simple":1547,"inflexible":1548,"complex":1549,"vllm_configure_logging":1550,"leaving":1551,"vllm_logging_config_path":1552,"unset":1553,"leave":1554,"fine":1555,"grained":1556,"custom":1557,"controls":1558,"whether":1559,"takes":1560,"enabled":1561,"disabled":1562,"given":1563,"root":1564,"logger":1565,"configured":1566,"defer":1567,"occur":1568,"while":1569,"starting":1570,"allows":1571,"specify":1572,"alternative":1573,"instead":1574,"schema":1575,"dictionary":1576,"customize":1577,"nhairs":1578,"container":1579,"log":1580,"stdout":1581,"console":1582,"info":1583,"begin":1584,"logging_config":1585,"formatters":1586,"pythonjsonlogger":1587,"jsonlogger":1588,"jsonformatter":1589,"handlers":1590,"streamhandler":1591,"formatter":1592,"stream":1593,"ext":1594,"sys":1595,"propagate":1596,"false":1597,"finally":1598,"variable":1599,"mistralai":1600,"particular":1601,"necessary":1602,"provide":1603,"target":1604,"configures":1605,"won":1606,"overrides":1607,"logging_utils":1608,"newlineformatter":1609,"datefmt":1610,"levelname":1611,"asctime":1612,"lineno":1613,"debug":1614,"example_noisy_logger":1615,"prevent":1616,"configuring":1617,"turn":1618,"silences":1619,"lmcache":1620,"demonstrates":1621,"prefilling":1622,"offloading":1623,"nixl":1624,"simply":1625,"dynamo":1626,"hf_token":1627,"cd":1628,"disagg_prefill_lmcache_v1":1629,"disagg_example_nixl":1630,"components":1631,"disagg_vllm_launcher":1632,"launches":1633,"servers":1634,"proxy":1635,"disagg_proxy_server":1636,"fastapi":1637,"coordinates":1638,"prefiller":1639,"decoder":1640,"configs":1641,"yaml":1642,"generates":1643,"logs":1644,"cpu_offload_lmcache":1645,"implementation":1646,"kv_cache_sharing_lmcache_v1":1647,"share":1648,"caches":1649,"disaggregated_prefill_lmcache_v0":1650,"prometheus":1651,"grafana":1652,"connect":1653,"metric":1654,"stack":1655,"launch":1656,"docker":1657,"checkout":1658,"methods":1659,"io":1660,"websites":1661,"compose":1662,"linux":1663,"entrypoint":1664,"submit":1665,"sample":1666,"datasets":1667,"anon8231489123":1668,"sharegpt_vicuna_unfiltered":1669,"resolve":1670,"sharegpt_v3_unfiltered_cleaned_split":1671,"bench":1672,"dataset":1673,"sharegpt":1674,"rate":1675,"navigating":1676,"8000":1677,"metrics":1678,"show":1679,"exposed":1680,"username":1681,"admin":1682,"password":1683,"connections":1684,"datasources":1685,"select":1686,"page":1687,"connection":1688,"containers":1689,"creates":1690,"dns":1691,"9090":1692,"click":1693,"save":1694,"green":1695,"saying":1696,"successfully":1697,"queried":1698,"datasource":1699,"screen":1700,"looks":1701,"imgur":1702,"r2vh9vw":1703,"helm":1704,"charts":1705,"chart":1706,"deploying":1707,"application":1708,"autoscaling":1709,"resource":1710,"defines":1711,"metadata":1712,"maintainers":1713,"ct":1714,"lintconf":1715,"linting":1716,"rules":1717,"values":1718,"validating":1719,"templates":1720,"_helpers":1721,"tpl":1722,"defining":1723,"configmap":1724,"template":1725,"configmaps":1726,"kubernetes":1727,"deployments":1728,"hpa":1729,"horizontal":1730,"pod":1731,"autoscaler":1732,"job":1733,"jobs":1734,"poddisruptionbudget":1735,"budget":1736,"pvc":1737,"persistent":1738,"volume":1739,"claims":1740,"secrets":1741,"services":1742,"disagg_proxy_demo":1743,"xpyd":1744,"kv_events":1745,"processing":1746,"handle":1747,"exceeds":1748,"maximum":1749,"context":1750,"length":1751,"quick":1752,"very":1753,"texts":1754,"3m":1755,"different":1756,"model_name":1757,"jinaai":1758,"jina":1759,"max_embed_len":1760,"1048576":1761,"documents":1762,"multilingual":1763,"3072000":1764,"comprehensive":1765,"description":1766,"startup":1767,"override":1768,"pooler":1769,"pooling_type":1770,"normalize":1771,"true":1772,"enable_chunked_processing":1773,"pooling":1774,"strategy":1775,"chunk":1776,"cross":1777,"aggregation":1778,"automatically":1779,"mean":1780,"native":1781,"combination":1782,"component":1783,"chunks":1784,"always":1785,"weighted":1786,"averaging":1787,"counts":1788,"optimal":1789,"processed":1790,"semantic":1791,"31090":1792,"gpu_count":1793,"cls":1794,"last":1795,"affects":1796,"api_key":1797,"empty":1798,"authentication":1799,"works":1800,"longer":1801,"max_model_len":1802,"smart":1803,"chunking":1804,"split":1805,"max_position_embeddings":1806,"maintain":1807,"unified":1808,"separately":1809,"combined":1810,"count":1811,"across":1812,"dimensionality":1813,"standard":1814,"handling":1815,"accepted":1816,"rejected":1817,"vllm_allow_long_max_model_len":1818,"extreme":1819,"academic":1820,"papers":1821,"references":1822,"legal":1823,"contracts":1824,"books":1825,"entire":1826,"chapters":1827,"repositories":1828,"codebases":1829,"aspect":1830,"minimal":1831,"proportional":1832,"scalable":1833,"quality":1834,"short":1835,"normal":1836,"baseline":1837,"100k":1838,"mixed":1839,"consistency":1840,"reproducible":1841,"troubleshooting":1842,"valueerror":1843,"position":1844,"4096":1845,"solution":1846,"reduce":1847,"runtimeerror":1848,"adjusting":1849,"fewer":1850,"slow":1851,"expected":1852,"due":1853,"calls":1854,"activity":1855,"150000":1856,"max_chunk_size":1857,"extend":1858,"architecture":1859,"lengths":1860,"validate":1861,"compared":1862,"updates":1863,"parameter":1864,"simplified":1865,"millions":1866,"better":1867,"exceed":1868,"limits":1869,"backward":1870,"existing":1871,"continue":1872,"structured":1873,"capabilities":1874,"constraint":1875,"responses":1876,"concurrent":1877,"choice":1878,"3b":1879,"reasoning":1880,"r1":1881,"distill":1882,"deepseek_r1":1883,"want":1884,"standalone":1885,"uv":1886,"uvx":1887,"git":1888,"subdirectory":1889,"online_serving":1890,"structured_outputs":1891,"tip":1892,"remotely":1893,"openai_base_url":1894,"remote_url":1895,"constraints":1896,"structural_tag":1897,"regex":1898,"opentelemetry":1899,"poc":1900,"packages":1901,"26":1902,"exporter":1903,"otlp":1904,"conventions":1905,"jaeger":1906,"jaegertracing":1907,"57":1908,"collector_zipkin_host_port":1909,"9411":1910,"6831":1911,"udp":1912,"6832":1913,"5778":1914,"16686":1915,"4317":1916,"4318":1917,"14250":1918,"14268":1919,"14269":1920,"shell":1921,"ip":1922,"jaeger_ip":1923,"inspect":1924,"networksettings":1925,"ipaddress":1926,"otel_exporter_otlp_traces_endpoint":1927,"grpc":1928,"insecure":1929,"otel_service_name":1930,"otel_exporter_otlp_traces_insecure":1931,"facebook":1932,"opt":1933,"125m":1934,"traces":1935,"dummy":1936,"dummy_client":1937,"webui":1938,"pane":1939,"hit":1940,"gyhhfjo":1941,"clicking":1942,"spans":1943,"tags":1944,"demo":1945,"containing":1946,"prompt":1947,"opf6cbl":1948,"protocol":1949,"protobuf":1950,"transport":1951,"otel_exporter_otlp_traces_protocol":1952,"follows":1953,"instrumentation":1954,"automatic":1955,"instrument":1956,"hywvooj":1957,"machete":1958,"precision":1959,"cutlass":1960,"gemm":1961,"spiritual":1962,"successor":1963,"marlin":1964,"kernel":1965,"hopper":1966,"architectures":1967,"pairs":1968,"epilogues":1969,"easier":1970,"overview":1971,"effectively":1972,"scale_type":1973,"w_s":1974,"dtype":1975,"compute_type":1976,"w_q":1977,"w_z":1978,"matrix":1979,"scales":1980,"zeropoints":1981,"fma":1982,"means":1983,"applied":1984,"supplied":1985,"subtracted":1986,"optimization":1987,"prepacking":1988,"closely":1989,"match":1990,"core":1991,"layouts":1992,"allowing":1993,"wider":1994,"shared":1995,"loads":1996,"prepacked":1997,"machete_gemm":1998,"flow":1999,"something":2000,"_custom_ops":2001,"ops":2002,"w_q_packed":2003,"machete_prepack_b":2004,"wtype":2005,"b_q":2006,"b_type":2007,"b_scales":2008,"b_group_size":2009,"group_size":2010,"tile":2011,"instantiations":2012,"typeconfig":2013,"appended":2014,"impl_configs":2015,"assuming":2016,"implconfig":2017,"bundles":2018,"scheduleconfig":2019,"specialization":2020,"heuristic":2021,"scheduler":2022,"etc":2023,"differently":2024,"problem":2025,"almost":2026,"never":2027,"beneficial":2028,"comes":2029,"maps":2030,"schedule":2031,"define":2032,"combinations":2033,"with_zeropoints":2034,"with_scales":2035,"compile":2036,"times":2037,"limiting":2038,"introduction":2039,"describes":2040,"implemented":2041,"fusing":2042,"de":2043,"onto":2044,"gemms":2045,"symmetric":2046,"weights":2047,"asymmetric":2048,"activations":2049,"per":2050,"scaledepilogue":2051,"bias":2052,"scaledepiloguebias":2053,"scaledepilogueazp":2054,"scaledepilogueazppertoken":2055,"passed":2056,"epilogue":2057,"induces":2058,"redundant":2059,"addition":2060,"operation":2061,"runtime":2062,"underlying":2063,"linear":2064,"algebra":2065,"activation":2066,"rfc":2067,"3975":2068,"widehat":2069,"matrices":2070,"become":2071,"math":2072,"s_a":2073,"j_a":2074,"z_a":2075,"s_b":2076,"respectively":2077,"ones":2078,"dimensions":2079,"expanding":2080,"further":2081,"calculate":2082,"left":2083,"known":2084,"ahead":2085,"row":2086,"equal":2087,"mathbf":2088,"vector":2089,"column":2090,"sums":2091,"computes":2092,"meaning":2093,"scale_a":2094,"scalar":2095,"scale_b":2096,"because":2097,"term":2098,"precomputed":2099,"stored":2100,"azp_with_adj":2101,"points":2102,"efficiently":2103,"precompute":2104,"becomes":2105,"outer":2106,"product":2107,"azp_adj":2108,"adjustment":2109,"azp":2110,"computation":2111,"dq":2112,"hide":2113,"navigation":2114,"toc":2115,"figure":2116,"markdown":2117,"span":2118,"60":2119,"style":2120,"strong":2121,"async":2122,"buttons":2123,"js":2124,"button":2125,"aria":2126,"label":2127,"star":2128,"subscription":2129,"icon":2130,"octicon":2131,"eye":2132,"watch":2133,"fork":2134,"forked":2135,"depends":2136,"looking":2137,"applications":2138,"roadmap":2139,"gaudi":2140,"accelerators":2141,"power":2142,"trainium":2143,"inferentia":2144,"announcing":2145,"intro":2146,"sosp":2147,"23x":2148,"reducing":2149,"p50":2150,"latency":2151,"cade":2152,"daniel":2153,"et":2154,"al":2155,"meetups":2156,"chosen":2157,"device":2158,"patterns":2159,"instance":2160,"production":2161,"training":2162,"rlhf":2163,"train":2164,"tune":2165,"outlines":2166,"strategies":2167,"consider":2168,"discovered":2169,"3aissue":2170,"been":2171,"choose":2172,"much":2173,"relevant":2174,"possible":2175,"debugged":2176,"remember":2177,"off":2178,"debugging":2179,"defined":2180,"avoid":2181,"lingering":2182,"settings":2183,"might":2184,"functionalities":2185,"activated":2186,"hangs":2187,"isn":2188,"downloaded":2189,"disk":2190,"internet":2191,"depend":2192,"recommended":2193,"guides":2194,"isolate":2195,"pay":2196,"store":2197,"clusters":2198,"filesystems":2199,"nodes":2200,"filesystem":2201,"additionally":2202,"too":2203,"lot":2204,"slowing":2205,"down":2206,"needs":2207,"frequently":2208,"swap":2209,"bottleneck":2210,"fit":2211,"oom":2212,"adopting":2213,"options":2214,"conserving_memory":2215,"consumption":2216,"changed":2217,"gh":2218,"12622":2219,"prior":2220,"came":2221,"neutral":2222,"onwards":2223,"come":2224,"generation_config":2225,"creator":2226,"higher":2227,"know":2228,"however":2229,"degraded":2230,"happening":2231,"trying":2232,"old":2233,"improves":2234,"continuing":2235,"petition":2236,"update":2237,"produces":2238,"generations":2239,"don":2240,"solve":2241,"stuck":2242,"somewhere":2243,"vllm_logging_level":2244,"vllm_log_stats_interval":2245,"statistics":2246,"tracking":2247,"queue":2248,"waiting":2249,"states":2250,"cuda_launch_blocking":2251,"identify":2252,"causing":2253,"nccl_debug":2254,"nccl":2255,"vllm_trace_function":2256,"record":2257,"function":2258,"inspection":2259,"tell":2260,"flag":2261,"unless":2262,"absolutely":2263,"delays":2264,"incorrect":2265,"cannot":2266,"correct":2267,"complicated":2268,"parallel_state":2269,"88":2270,"world_size":2271,"rank":2272,"local_rank":2273,"distributed_init_method":2274,"tcp":2275,"xxx":2276,"54641":2277,"backend":2278,"vllm_host_ip":2279,"your_ip_address":2280,"nccl_socket_ifname":2281,"your_network_interface":2282,"gloo_socket_ifname":2283,"near":2284,"self":2285,"replay":2286,"captures":2287,"worker":2288,"model_runner":2289,"inside":2290,"cudagraph":2291,"causes":2292,"enforce_eager":2293,"exact":2294,"driver":2295,"established":2296,"instructions":2297,"confirm":2298,"correctly":2299,"torch":2300,"dist":2301,"init_process_group":2302,"get_rank":2303,"device_count":2304,"set_device":2305,"floattensor":2306,"all_reduce":2307,"op":2308,"reduceop":2309,"sum":2310,"synchronize":2311,"item":2312,"get_world_size":2313,"assert":2314,"got":2315,"successful":2316,"gloo":2317,"gloo_group":2318,"new_group":2319,"ranks":2320,"cpu_data":2321,"exit":2322,"device_communicators":2323,"pynccl":2324,"pyncclcommunicator":2325,"manually":2326,"prefer":2327,"fill_":2328,"cuda_graph":2329,"current_stream":2330,"destroy_process_group":2331,"adjust":2332,"nproc":2333,"torchrun":2334,"nnodes":2335,"master_addr":2336,"master":2337,"reachable":2338,"rdzv_backend":2339,"c10d":2340,"rdzv_endpoint":2341,"sanity":2342,"usually":2343,"drivers":2344,"broken":2345,"sense":2346,"administrator":2347,"assistance":2348,"workaround":2349,"nccl_p2p_disable":2350,"helps":2351,"deeplearning":2352,"env":2353,"still":2354,"fix":2355,"distnetworkerror":2356,"assign":2357,"commands":2358,"multiprocessing":2359,"50":2360,"multiproc_worker_utils":2361,"281":2362,"initialized":2363,"spawn":2364,"vllm_worker_multiproc_method":2365,"finished":2366,"bootstrapping":2367,"phase":2368,"probably":2369,"child":2370,"processes":2371,"forgotten":2372,"proper":2373,"idiom":2374,"module":2375,"__name__":2376,"__main__":2377,"freeze_support":2378,"omitted":2379,"program":2380,"going":2381,"frozen":2382,"produce":2383,"executable":2384,"safe":2385,"importing":2386,"guard":2387,"behind":2388,"block":2389,"heavily":2390,"optimize":2391,"introduces":2392,"dependency":2393,"triton":2394,"functions":2395,"10406":2396,"sin":2397,"randn":2398,"raises":2399,"_inductor":2400,"12219":2401,"failed":2402,"inspected":2403,"model_executor":2404,"registry":2405,"_raise_for_unsupported":2406,"arch":2407,"related":2408,"missing":2409,"outdated":2410,"binaries":2411,"carefully":2412,"traceback":2413,"call":2414,"inspect_model_cls":2415,"typeerror":2416,"nonetype":2417,"iterable":2418,"resolution":2419,"steps":2420,"model_resolution":2421,"explicitly":2422,"infer":2423,"platforms":2424,"__init__":2425,"infers":2426,"14195":2427,"detailed":2428,"unhandled":2429,"ncclcomminitrank":2430,"workload":2431,"gpudirect":2432,"rdma":2433,"encounters":2434,"executing":2435,"init_device":2436,"deadlock":2437,"usr":2438,"lib":2439,"99":2440,"comm":2441,"ncclcomm_t":2442,"pynccl_wrapper":2443,"277":2444,"nccl_check":2445,"_funcs":2446,"ctypes":2447,"byref":2448,"256":2449,"error_str":2450,"indicates":2451,"initialize":2452,"communicator":2453,"possibly":2454,"ipc_lock":2455,"capability":2456,"unmounted":2457,"dev":2458,"shm":2459,"enabling":2460,"parallelism_scaling":2461,"guidance":2462,"properly":2463,"caused":2464,"zmq":2465,"zeromq":2466,"pyzmq":2467,"occasionally":2468,"hang":2469,"depending":2470,"6759":2471,"circumvent":2472,"1234":2473,"nccl_cumem_enable":2474,"cumem":2475,"allocator":2476,"gives":2477,"benefits":2478,"inconsistent":2479,"crash":2480,"observed":2481,"openrlhf":2482,"pull":2483,"604":2484,"discussion":2485,"5723":2486,"issuecomment":2487,"2554389656":2488,"deprecating":2489,"18571":2490,"gradually":2491,"inviter":2492,"reason":2493,"independently":2494,"grew":2495,"increasingly":2496,"complexity":2497,"harder":2498,"debt":2499,"revealing":2500,"streamlined":2501,"design":2502,"building":2503,"success":2504,"retains":2505,"proven":2506,"utilities":2507,"re":2508,"architects":2509,"covering":2510,"manager":2511,"sampler":2512,"cohesive":2513,"maintainable":2514,"framework":2515,"accommodates":2516,"growth":2517,"innovation":2518,"specifically":2519,"aims":2520,"modular":2521,"hack":2522,"codebase":2523,"combine":2524,"optimizations":2525,"upgrading":2526,"scenarios":2527,"published":2528,"living":2529,"limitations":2530,"actively":2531,"bring":2532,"therefore":2533,"updated":2534,"constantly":2535,"progress":2536,"towards":2537,"falls":2538,"nearly":2539,"fully":2540,"planned":2541,"operational":2542,"ongoing":2543,"wip":2544,"active":2545,"scheduled":2546,"rfcs":2547,"delayed":2548,"temporarily":2549,"dropped":2550,"later":2551,"deprecated":2552,"demand":2553,"treats":2554,"num_tokens":2555,"dynamically":2556,"allocate":2557,"fixed":2558,"prefills":2559,"strict":2560,"separation":2561,"phases":2562,"scheduling":2563,"policies":2564,"served":2565,"fcfs":2566,"priority":2567,"assigned":2568,"tie":2569,"breaker":2570,"configurable":2571,"nobr":2572,"x86":2573,"_64":2574,"aarch64":2575,"macos":2576,"plugins":2577,"ascend":2578,"spyre":2579,"openvino":2580,"encoder":2581,"mamba":2582,"excludes":2583,"supportsv0only":2584,"corresponds":2585,"initial":2586,"hidden":2587,"processor":2588,"12249":2589,"global":2590,"logits":2591,"13360":2592,"simultaneous":2593,"selective":2594,"space":2595,"mechanisms":2596,"layers":2597,"mamba2forcausallm":2598,"mambaforcausallm":2599,"disabling":2600,"bambaforcausallm":2601,"zamba2forcausallm":2602,"nemotronhforcausallm":2603,"falconh1forcausallm":2604,"granitemoehybridforcausallm":2605,"jambaforcausallm":2606,"hybrid":2607,"minimaxtext01forcausallm":2608,"minimaxm1forcausallm":2609,"mode":2610,"requiring":2611,"bartforconditionalgeneration":2612,"mllamaforconditionalgeneration":2613,"calculation":2614,"devices":2615,"15191":2616,"spec":2617,"13414":2618,"backends":2619,"best_of":2620,"13361":2621,"processors":2622,"swapping":2623,"differences":2624,"returned":2625,"immediately":2626,"computed":2627,"applying":2628,"scaling":2629,"penalty":2630,"adjustments":2631,"reflect":2632,"adjusted":2633,"probabilities":2634,"turned":2635,"recomputation":2636,"recover":2637,"upon":2638,"rework":2639,"legacy":2640,"moving":2641,"preemptions":2642,"fallbacks":2643,"inter":2644,"communications":2645,"protected":2646,"placing":2647,"isolated":2648,"transfer":2649,"127":2650,"14579":2651,"data_parallel_master_ip":2652,"data_parallel_master_port":2653,"29500":2654,"considerations":2655,"intended":2656,"internal":2657,"untrusted":2658,"environments":2659,"networks":2660,"authorization":2661,"sent":2662,"unencrypted":2663,"anywhere":2664,"checks":2665,"isolation":2666,"deploy":2667,"segmentation":2668,"unauthorized":2669,"implement":2670,"firewall":2671,"practices":2672,"rather":2673,"firewalls":2674,"ports":2675,"restrict":2676,"interfaces":2677,"principle":2678,"protecting":2679,"unsafe":2680,"frameworks":2681,"listening":2682,"sometimes":2683,"outside":2684,"direct":2685,"concern":2686,"host":2687,"initialization":2688,"tcpstore":2689,"listens":2690,"protections":2691,"put":2692,"place":2693,"reach":2694,"perspective":2695,"intentional":2696,"protect":2697,"expose":2698,"minimum":2699,"surface":2700,"area":2701,"trusted":2702,"hosts":2703,"consult":2704,"believe":2705,"found":2706,"reproducibility":2707,"guarantee":2708,"sake":2709,"achieve":2710,"deterministic":2711,"vllm_enable_v1_multiprocessing":2712,"seed":2713,"random":2714,"locality":2715,"impossible":2716,"generators":2717,"np":2718,"manual_seed":2719,"accordingly":2720,"none":2721,"remain":2722,"un":2723,"workers":2724,"17929":2725,"constructs":2726,"worry":2727,"accidentally":2728,"making":2729,"subsequent":2730,"rely":2731,"stats":2732,"collection":2733,"collects":2734,"anonymous":2735,"engineering":2736,"understand":2737,"widely":2738,"prioritize":2739,"efforts":2740,"workloads":2741,"transparent":2742,"sensitive":2743,"subset":2744,"cleaning":2745,"publicly":2746,"benefit":2747,"usage_lib":2748,"uuid":2749,"fbe880e9":2750,"084d":2751,"4cab":2752,"a395":2753,"8984c50f1109":2754,"provider":2755,"gcp":2756,"num_cpu":2757,"cpu_type":2758,"xeon":2759,"20ghz":2760,"cpu_family_model_stepping":2761,"85":2762,"total_memory":2763,"101261135872":2764,"x86_64":2765,"28":2766,"amd64":2767,"glibc2":2768,"gpu_type":2769,"l4":2770,"gpu_memory_per_device":2771,"23580639232":2772,"model_architecture":2773,"optforcausallm":2774,"vllm_version":2775,"cu123":2776,"llm_class":2777,"log_time":2778,"1711663373492490000":2779,"float16":2780,"tensor_parallel_size":2781,"block_size":2782,"gpu_memory_utilization":2783,"kv_cache_dtype":2784,"enable_lora":2785,"enable_prefix_caching":2786,"disable_custom_all_reduce":2787,"preview":2788,"tail":2789,"usage_stats":2790,"opting":2791,"vllm_no_usage_stats":2792,"do_not_track":2793,"mkdir":2794,"touch":2795,"exposes":2796,"health":2797,"unsloth":2798,"1b":2799,"query":2800,"curl":2801,"iteration_tokens_total":2802,"histogram":2803,"engine_step":2804,"iteration_tokens_total_sum":2805,"iteration_tokens_total_bucket":2806,"le":2807,"64":2808,"512":2809,"definitions":2810,"escape":2811,"hatch":2812,"removed":2813,"asked":2814,"referring":2815,"another":2816,"layer":2817,"route":2818,"listed":2819,"extracting":2820,"convert":2821,"inferior":2822,"trained":2823,"vary":2824,"yes":2825,"variations":2826,"numerical":2827,"instability":2828,"batched":2829,"accuracy":2830,"numerical_accuracy":2831,"computations":2832,"slice":2833,"factors":2834,"expansion":2835,"slightly":2836,"logit":2837,"logprob":2838,"accumulate":2839,"potentially":2840,"resulting":2841,"sampled":2842,"divergence":2843,"mitigation":2844,"improved":2845,"stability":2846,"reduced":2847,"variance":2848,"float32":2849,"bfloat16":2850,"switching":2851,"seeds":2852,"aid":2853,"achieving":2854,"discrepancies":2855,"three":2856,"levels":2857,"highest":2858,"lowest":2859,"engine_args":2860,"env_vars":2861,"tuning":2862,"covers":2863,"conserve":2864,"preemption":2865,"regressive":2866,"insufficient":2867,"preempt":2868,"preempted":2869,"recomputed":2870,"again":2871,"occurs":2872,"00":2873,"49":2874,"33":2875,"1057":2876,"sequence":2877,"preemptionmode":2878,"recompute":2879,"enough":2880,"total_cumulative_preemption_cnt":2881,"mechanism":2882,"ensures":2883,"robustness":2884,"adversely":2885,"encounter":2886,"allocates":2887,"percentage":2888,"increasing":2889,"utilization":2890,"decrease":2891,"max_num_seqs":2892,"max_num_batched_tokens":2893,"reduces":2894,"thereby":2895,"shards":2896,"excessive":2897,"synchronization":2898,"pipeline_parallel_size":2899,"distributes":2900,"indirectly":2901,"penalties":2902,"cumulative":2903,"disable_log_stats":2904,"lower":2905,"smaller":2906,"together":2907,"improve":2908,"balancing":2909,"bound":2910,"conditionally":2911,"prioritizes":2912,"batches":2913,"pending":2914,"schedules":2915,"itl":2916,"prioritized":2917,"locating":2918,"ttft":2919,"8096":2920,"especially":2921,"equivalent":2922,"16384":2923,"pdf":2924,"2401":2925,"08671":2926,"2308":2927,"16369":2928,"tp":2929,"pressure":2930,"essential":2931,"pp":2932,"parts":2933,"maxed":2934,"distribute":2935,"deep":2936,"narrow":2937,"distribution":2938,"sharding":2939,"ep":2940,"specialized":2941,"experts":2942,"moe":2943,"deepseekv3":2944,"qwen3moe":2945,"balance":2946,"enable_expert_parallel":2947,"degree":2948,"dp":2949,"replicates":2950,"data_parallel_size":2951,"sharded":2952,"data_parallel_deployment":2953,"useful":2954,"excess":2955,"capacity":2956,"vl":2957,"correspondance":2958,"repeatedly":2959,"autoprocessor":2960,"commonly":2961,"conversations":2962,"mm_processor_cache_gb":2963,"gib":2964,"completely":2965,"larger":2966,"toc_depth":2967,"openai_compatible_server":2968,"engineargs":2969,"arg_utils":2970,"asyncengineargs":2971,"interested":2972,"truth":2973,"types":2974,"docstrings":2975,"json_tip":2976,"inc":2977,"async_engine_args":2978,"vllm_port":2979,"prefixed":2980,"vllm_":2981,"care":2982,"taken":2983,"conflict":2984,"capitalized":2985,"concepts":2986,"networking":2987,"envs":2988,"vars":2989,"definition":2990,"tips":2991,"serves":2992,"handy":2993,"optimizing":2994,"sizing":2995,"selecting":2996,"ideal":2997,"chips":2998,"average":2999,"adequate":3000,"hbm":3001,"colab":3002,"calculator":3003,"ericehanley":3004,"rightsize":3005,"hbm_calculator":3006,"ipynb":3007,"requirement":3008,"consumed":3009,"allocated":3010,"approximately":3011,"num":3012,"seqs":3013,"general":3014,"rule":3015,"thumb":3016,"tradeoff":3017,"rightsizing":3018,"decreasing":3019,"simultaneously":3020,"maximize":3021,"increases":3022,"crucial":3023,"desired":3024,"compilation":3025,"background":3026,"ll":3027,"notice":3028,"tpus":3029,"asics":3030,"compiled":3031,"static":3032,"graphs":3033,"compiler":3034,"unlike":3035,"dynamic":3036,"flexibly":3037,"shape":3038,"manage":3039,"warmup":3040,"compiles":3041,"saves":3042,"minutes":3043,"hour":3044,"although":3045,"directly":3046,"eliminating":3047,"vllm_xla_cache_path":3048,"shareable":3049,"deployed":3050,"ranges":3051,"impacted":3052,"discussed":3053,"influence":3054,"things":3055,"vllm_tpu_most_model_len":3056,"most_model_len":3057,"shorter":3058,"occasional":3059,"negatively":3060,"introducing":3061,"specifying":3062,"32k":3063,"2k":3064,"32768":3065,"subdivided":3066,"latter":3067,"category":3068,"gain":3069,"padding":3070,"requirements":3071,"vllm_tpu_bucket_padding_gap":3072,"layout":3073,"increments":3074,"pads":3075,"sending":3076,"recompilation":3077,"efficiencies":3078,"pad":3079,"exponential":3080,"nearest":3081,"linearly":3082,"buckets":3083,"increment":3084,"padding_gap":3085,"192":3086,"320":3087,"384":3088,"448":3089,"unnecessary":3090,"300":3091,"bucket_padding":3092,"careful":3093,"gap":3094,"leading":3095,"increased":3096,"precompile":3097,"compilaed":3098,"conversely":3099,"overly":3100,"yields":3101,"improvement":3102,"matches":3103,"chip":3104,"acceleration":3105,"v5e":3106,"mxu":3107,"formats":3108,"w8a8":3109,"w8a16":3110,"fp4":3111,"w4a8":3112,"parallelization":3113,"fragment":3114,"strongly":3115,"tuner":3116,"auto_tune":3117,"readme":3118,"topics":3119,"cover":3120,"interpreting":3121,"challenging":3122,"expand":3123,"meantime":3124,"collect":3125,"tools":3126,"profiling_tpu":3127,"valuable":3128,"insights":3129,"spmd":3130,"love":3131,"hear":3132,"conserving":3133,"alleviate":3134,"option":3135,"splits":3136,"granite":3137,"initializes":3138,"initializing":3139,"subprocess":3140,"cuda_visible_devices":3141,"whole":3142,"makes":3143,"reading":3144,"checkpoint":3145,"save_sharded_state":3146,"conversion":3147,"faster":3148,"constant":3149,"cost":3150,"statically":3151,"red":3152,"hat":3153,"redhatai":3154,"extra":3155,"adept":3156,"fuyu":3157,"capture":3158,"compilation_config":3159,"speed":3160,"compilationconfig":3161,"compilationlevel":3162,"piecewise":3163,"goes":3164,"cudagraph_capture_sizes":3165,"capturing":3166,"ram":3167,"vllm_cpu_kvcache_space":3168,"items":3169,"footprint":3170,"images":3171,"limit_mm_per_prompt":3172,"go":3173,"unused":3174,"accepts":3175,"videos":3176,"gemma":3177,"27b":3178,"mm_processor_kwargs":3179,"max_pixels":3180,"768":3181,"1280":3182,"internvl":3183,"opengvlab":3184,"internvl2":3185,"2b":3186,"max_dynamic_patch":3187,"outlined":3188,"serve_args":3189,"6379":3190,"uvicorn":3191,"precedence":3192,"priorities":3193,"some_model":3194,"over":3195,"inspecting":3196,"field":3197,"finding":3198,"registered":3199,"nevertheless":3200,"fail":3201,"lacks":3202,"unofficial":3203,"recorded":3204,"ambiguity":3205,"hf_overrides":3206,"cerebras":3207,"gpt":3208,